Repository: projectcomet64/M64MM
Catalog: M64MM2/Properties/Resources.*.resx
Languages: es, zh_cn

# animDataNotLoaded
source: Animation data not loaded!
es: ¡Los datos de animación no están cargados!
zh_cn: 动画数据未被加载！

source: Camera data not loaded!
es: ¡Los datos de cámara no están cargados!
zh_cn: 相机数据未被加载！

source: Camera State: Default
es: Cámara: Por defecto
zh_cn: 相机状态：默认

source: Camera State: Frozen
es: Cámara: Congelada
zh_cn: 相机状态：冻结

source: Camera State: Soft-Frozen
es: Cámara: Congelada (Suave)
zh_cn: 相机状态：软冻结

# colorCodeExportMsg
source: Here's your generated color code:
es: Aquí está tu código de color generado:
zh_cn: 这是您所生成的颜色代码：

# colorCodeImportMsg
source: Please paste your color code below, then click OK.
es: Por favor pega tu código de color aquí, luego presiona OK
zh_cn: 请将您的颜色代码粘贴在下方，然后点击 OK 。

# invalidColorCodeMsg1
source: Invalid color code: line {0} is too {1}.
es: Código de color inválido: La línea {0} es demasiado {1}.
zh_cn: 无效颜色代码：第 {0} 行过 {1} 。

# invalidColorCodeMsg2
source: Invalid color code: line {0} is trying to edit memory address {1}, which is not where Mario's color data is located. Make sure you're not using a PAL region color code!
es: Código de color inválido: La línea {0} está intentando editar la dirección de memoria {1}, que no es donde se encuentran los datos de color de Mario. ¡Asegúrate de no usar un código de color PAL!
zh_cn: 无效颜色代码：第 {0} 行正在试图编辑内存 {1}，但并非马力欧的颜色数据所在地址。确保您没有使用 PAL 地区的颜色代码！

# invalidColorCodeMsgLong
source: long
es: larga
zh_cn: 长

# invalidColorCodeMsgShort
source: short
es: corta
zh_cn: 短

# invalidColorCodeMsgTitle
source: Invalid Color Code
es: Código de color inválido
zh_cn: 无效颜色代码

# programStatus1
source: Status: Project64/Mupen not open.
es: Estado: Project64/Mupen no abierto.
zh_cn: 状态：Project64 未打开。

# programStatus2
source: Status: Base address not found.
es: Estado: Dir. base no encontrada
zh_cn: 状态：内存地址未找到。

# programStatus3
source: Status: Base address found at
es: Estado: Dirección base:
zh_cn: 状态：内存地址为：

# setDefaultColorsMsg
source: Set these colors as default?
es: ¿Establecer como colores por defecto?
zh_cn: 将这些颜色设为默认？

# setDefaultColorsMsgTitle
source: Set defaults?
es: ¿Establecer por defecto?
zh_cn: 设置为默认？

# invalidAnimSelected
source: You have entered an invalid animation name into {0}. Please make sure to choose a valid option from the list.
es: Intentaste cargar un nombre de animación inválido en {0}. Asegúrate de escoger una opción válida de la lista.
zh_cn: 您输入了因过 {0} 而无效的颜色代码。请确保从列表中选择了正确选项。

# programStatusAwaitingLevel
source: Status: Waiting for level. Base addr. found at:
es: Estado: Esperando nivel. D.B.:
zh_cn: 状态：等待加载关卡--内存地址为：

# colorCodeEmptyRom
source: ...This ROM has no model data. The color codes and shading only apply to vanilla models and mods that support it.
es: ...Este ROM no tiene datos de modelo. No funcionará.
zh_cn: ......此 ROM 文件不包含模型文件。

# colorCodeModdedRom
source: This ROM has a different model data compared to Mario's usual model data. If you're using a X3S ROM, change the Color Parts Override to X3S to use it.
es: Este ROM tiene datos de modelo diferentes de los usuales de Mario. Si estás usando un mod compatible con X3S, usa el Override de partes de color X3S para poder usar el tinte.
zh_cn: 此ROM中的马力欧模型数据与正常不同并且不是一个兼容的CometROM。颜色代码编辑器与阴影编辑器已被禁用。它们在此ROM中可能无法正常运作。

# picturedInBannerMsg
source: In banner:
es: En la imagen:
zh_cn: 在横幅上：

# updateCurrentVersion
source: Current:
es: Actual:
zh_cn: 当前：

# updateLatestVersion
source: Latest:
es: Última:
zh_cn: 最新：

# updateUpdateNow
source: (Update available!)
es: (¡Actualización disponible!)
zh_cn: （可用更新！）

# updateUpToDate
source: (You're up to date!)
es: (¡Estás al día!)
zh_cn: （您正使用最新版！）

# colorCodeErrorFileReading
source: Could not read color code from file.\n{0}
es: No se pudo leer el código de color desde el archivo.\n{0}
zh_cn: 无法从文件中读取颜色代码。\n{0}

# colorCodeErrorWriting
source: Could not write color code to file.\n{0}
es: No se pudo escribir el código de color en el archivo.\n{0}
zh_cn: 无法向文件中写入颜色代码。\n{0}

# colorCodeFromFile
source: From file...
es: Abrir...
zh_cn: 从文件......

# colorCodeToFile
source: To file...
es: Guardar...
zh_cn: 到文件......

# cameraToggleFrozen
source: Frozen:
es: Congelada:
zh_cn: 冻结：

# cameraToggleSoftFrozen
source: Soft-frozen:
es: Congelado suave:
zh_cn: 软冻结：

source: Yes
es: Sí
zh_cn: 是

# colorCodeSPARKRom
source: This is a ROM with a header that looks like a SPARK color codeable mod. Currently, the Appearance Settings does not support SPARK, so you might want to get the CometSPARK Editor Addon at https://comet.glitchypsi.xyz
es: Este ROM tiene un encabezado que se asemeja al de un mod SPARK. En este momento, el editor de apariencia no es compatible con SPARK. Se recomienda obtener el add-on del editor de SPARK en https://comet.glitchypsi.xyz
zh_cn: 此 ROM 似乎包含 SPARK 可编辑颜色代码模组。目前，外观设置不支持 SPARK, 所以您也许需要从https://comet.glitchypsi.xyz 下载 CometSPARK 扩展。

# updateNetworkError
source: Something happened. Could not reach the GitHub page for updates. Check your network connection.
es: Algo pasó. No se pudo conectar a la página de GitHub para las actualizaciones. Revisa tu conexión a Internet.
zh_cn: 发生故障。无法连接到 GitHub 网站来获得更新。请检查网络连接。

# powercamIngameDirtyMsg
source: You started the game in a level that would cause problems with Powercam, so you can't enable it here. Enter a level that doesn't zoom out when the game is paused and enable Powercam again.
es: Iniciaste el juego en un nivel que causa problemas con Powercam, así que aquí no se puede habilitar. Entra a un nivel cuya cámara no haga zoom cuando pauses y activa Powercam.
zh_cn: 你打开了一个使用 Powercam 可能会导致问题的关卡，所以你无法启用 Powercam。 请在游戏暂停时进入一个镜头未缩小的关卡并打开Powercam。

# powercamIngameDirtyTitle
source: There is a time and a place for everything, but not here!
es: Hay un tiempo y lugar para todo, ¡pero aquí no!
zh_cn: 现在这是不合适的。

# powercamPregameDirtyMsg
source: You started the game in a level that would mess with your camera if Powercam is first enabled in it, so we've disabled it for you. Enter a level that doesn't zoom out when the game is paused and enable Powercam again.
es: Iniciaste el juego en un nivel que causa problemas con Powercam si se activa dentro de sí, así que te lo deshabilitamos. Entra a un nivel cuya cámara no haga zoom cuando pauses y activa Powercam.
zh_cn: 如果您加载了一个已经打开了Powercam的关卡，摄像机可能会出现错误，所以我们已经为您关闭了。 请在游戏暂停时进入一个镜头未缩小的关卡并打开Powercam。

# powercamPregameDirtyTitle
source: Wait, this is important.
es: Atento!
zh_cn: 请注意，这很重要。

# inaccessibleEmuMsg
source: The selected emulator (or only available opened emulators) cannot be accessed by M64MM. This often happens if the emulator started as Administrator. There is no reason to start the emulator as an administrator. To use M64MM, please start the emulator without administrator privileges.
es: El emulador seleccionado (o único disponible) no puede ser accedido por M64MM. Esto ocurre usualmente cuando el emulador ha sido abierto con permisos de administrador. No hay razón por la cual debas iniciar el emulador como administrador. Para usar M64MM, inicia el emulador sin otorgarle permisos de administrador.

# programStatusInaccessible
source: Status: Couldn't open Project64/Mupen
es: Estado: No se puedo acceder al emulador.

# prereleaseString
source: -alpha8.b1
zh_cn: -alpha7-e

source: No
zh_cn: 否
